Revit 2026 API

# CameraTransform Method

---

Transforms the camera

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Transform(
	Transform trf
)
```
```vb
Public Sub Transform (
	trf As Transform
)
```
```cpp
public:
void Transform(
	Transform^ trf
)
```
```fsharp
member Transform :
        trf : Transform -> unit
```

#### Parameters

trf Transform

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Camera Class

Autodesk.Revit.DB.DirectContext3D Namespace